Revit 2027 API
TagOrientationBehavior Enumeration
 This attribute describes the family orientation behavior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TagOrientationBehavior
Public Enumeration TagOrientationBehavior
public enum class TagOrientationBehavior
type TagOrientationBehavior
Members
Member name | Value | Description
Fixed | 0
RotateAndStayUpright | 2
RotateWithHost | 1
See Also
Reference
Autodesk.Revit.DB Namespace